# Start

## This is Pandas basic Practice with all the columns and all

In [5]:
import pandas as pd

df = pd.read_excel('stock_data.xlsx')

In [6]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [7]:
df.head() #will get top 5 rows

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [8]:
df.head(2)

  tickers    eps  revenue price      people
0   GOOGL  27.82       87   845  larry page
1     WMT   4.61      484    65        n.a.

In [9]:
df.tail(2)

  tickers            eps  revenue price         people
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [11]:
df = pd.read_excel('stock_data.xlsx', nrows = 2)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [13]:
df['tickers']

0    GOOGL
1      WMT
Name: tickers, dtype: object

In [14]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [18]:
df[['tickers','eps']]

  tickers    eps
0   GOOGL  27.82
1     WMT   4.61

In [19]:
df[df.columns]

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [20]:
df = pd.read_excel('stock_data.xlsx')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [21]:
df['revenue'].mean()

141.0

In [22]:
df.describe()

          revenue
count    5.000000
mean   141.000000
std    195.029485
min     -1.000000
25%     50.000000
50%     85.000000
75%     87.000000
max    484.000000

In [43]:
type(df.eps[0])

float

In [47]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [46]:
df[df.revenue >= 5.0]

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani

In [50]:
df['tickers'][df.revenue >= 5.0]

0    GOOGL
1      WMT
2     MSFT
3     RIL
Name: tickers, dtype: object

In [51]:
df[['tickers','eps']][df.revenue >= 5.0]

  tickers            eps
0   GOOGL          27.82
1     WMT           4.61
2    MSFT             -1
3    RIL   not available

In [53]:
df[['tickers','eps', 'revenue']][df.revenue == df.revenue.max()]

  tickers   eps  revenue
1     WMT  4.61      484

In [54]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [58]:
df.set_index('tickers', inplace=True)

In [59]:
df.loc['GOOGL']

eps             27.82
revenue            87
price             845
people     larry page
Name: GOOGL, dtype: object

In [60]:
df.reset_index(inplace=True)

In [61]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

## Completed
#### By Ashu, inspired by Codebasic